Revit 2024 API
Stairs.ActualTreadDepth Property
 The actual depth of the stairs treads in the stairs, actual tread depth is equal to minimum tread depth by default.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double ActualTreadDepth { get; set; }
Visual Basic
Public Property ActualTreadDepth As Double
	Get
	Set
Visual C++
public:
property double ActualTreadDepth {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for actualTreadDepth must be greater than 0 and no more than 30000 feet.
See Also
Stairs Class
Autodesk.Revit.DB.Architecture Namespace